<center> 

# Introduction to Data Science
    
## DataFrames Operations

### Dr. Lange
### Data 118 - Winter 2024 
    
</center>
<center> 
<img src="https://raw.githubusercontent.com/amandakube/Data118LectureImages/main/UChicago_DSI.png" alt="UC-DSI" width="600" height="700">
</center>

## Our repertoire: 

* Arithmetic Operations
* Comparisons
* Assignment Statements
* Call Expressions
* Arrays
* Lists
* DataFrames
    - Slicing/extraction
    - methods

In [1]:
import numpy as np
import pandas as pd

## Last notebook...

### We can extract slices of our DataFrame based on 

 - label --------> .loc
 
 - based on integer index --------> .iloc
 
 - based on condition

### Some important attributes and methods of DataFrames:

 - .columns
 
 - .shape
 
 - .drop()
 
 - sort.values  (by=...)

## Today

DataFrame Methods (Operations)

- grouping by specific columns

    - ```.groupby()```
    
- pivot table

    - ```.pivot_table()```
    
- merging data!
    - ```pd.merge()```

## Back to Titanic data...

In [4]:
import pandas as pd

titanic = pd.read_csv('../data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Review Question**

How can we find out more about the oldest passenger in this data?

In [ ]:
#???

The `groupby` function allows us to split the DataFrame into groups.

 - We can group data into new DataFrames
 - We can apply a method to groups of data

The most important input to this function is what we are grouping *by*, a column name. The general format of the `groupby` operation is given by:

```python
df.groupby(by='group_name')
```

In [16]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
group_by_class = titanic.groupby('Pclass')
group_by_class

In [18]:
# gives the first row from each group
group_by_class.first()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,10,1,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,D56,C
3,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,G6,S

In [19]:
#this is saying: We want the group with Pclass == 1
group_by_class.get_group(1).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

Note, we can do this already with ```.loc``` for this.

In [20]:
titanic.loc[titanic.Pclass == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

Why use ```.groupby()```?

## Aggregate statistics

Often, we want to compute aggregate statistics over rows!

For example, what was the average age for each class?

In [21]:
titanic.groupby('Pclass').mean(numeric_only=True)

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

### What if I only want the 'Age' column?

In [22]:
type(titanic.groupby('Pclass').mean(numeric_only=True))

pandas.core.frame.DataFrame

This groupby **is** a DataFrame! So we can extract the column.

In [23]:
titanic.groupby('Pclass').mean(numeric_only=True)[['Age']]

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

## How did I get this?

<center>
<img src="https://raw.githubusercontent.com/SusannaLange/Data_118_images/main/images/titanic/titanic_groupby.png" alt="titanic" width="80%">
    
</center>

## What can I aggregate by?

**Common Aggregate Functions**

.count() – Number of observations

.sum() – Sum of values

.mean() – Mean of values

.median() – Arithmetic median of values

.min() – Minimum

.max() – Maximum

.mode() – Mode

.std() – Standard deviation

.var() – Variance

## <code style="background:Thistle;color:black">How many people were in each class?</code>

In [ ]:
titanic.groupby(???).???

One of the below...but which one?

In [27]:
titanic.groupby('Pclass').sum()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,99705,136,"Cumings, Mrs. John Bradley (Florence Briggs Th...",femalefemalemalefemalemalemalemalefemalemalema...,7111.42,90,77,PC 175991138031746311378311378819950PC 17601PC...,18177.4125,C85C123E46C103A6C23 C25 C27B78D33B30C52B28C83C...,CSSSSSCCCSCCSCSCSSSCCSSCSSSCSCSSSCCSSCCCCCSSQS...
2,82056,87,"Nasser, Mrs. Nicholas (Adele Achem)Hewlett, Mr...",femalefemalemalemalemalemalefemalefemalefemale...,5168.83,74,70,237736248706244373239865248698C.A. 2457911668S...,3801.8417,D56F33E101F2F4F2DE101DF2F33DF33F4E101E77,CSSSSSSCSSSSSSSSSSSSCSSSCSSSSSSSCSSSSSSSSSSSSS...
3,215625,119,"Braund, Mr. Owen HarrisHeikkinen, Miss. LainaA...",malefemalemalemalemalefemalefemalemalemalefema...,8924.92,302,193,A/5 21171STON/O2. 3101282373450330877349909347...,6714.6951,G6F G73F E69G6G6G6E10F G63F G73E121F38E121,SSSQSSSSSSQSCQSSCQSQCSSCSCQSQQCSSSCSCSCSSSSCSS...

In [26]:
titanic.groupby('Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,216
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

#### Sometimes getting weird numbers....we can explore more!

In [28]:
titanic['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

## <code style="background:Thistle;color:black">How many total survivors?</code>

In [29]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic.groupby(???).???

Could we have used ```.loc``` for this?

But what differences do we see?

In [30]:
titanic.loc[titanic.Survived == 1].count()

PassengerId    342
Survived       342
Pclass         342
Name           342
Sex            342
Age            290
SibSp          342
Parch          342
Ticket         342
Fare           342
Cabin          136
Embarked       342
dtype: int64

### Back to Groupby

Recall, we can extract as a single DataFrame

In [34]:
titanic.groupby('Survived').count()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,,
0,549,549,549,549,424,549,549,549,549,68,549
1,342,342,342,342,290,342,342,342,342,136,342

In [35]:
titanic.groupby('Survived').count()[['Name']]

          Name
Survived
0          549
1          342

Notice we have a DataFrame with a column name as an index. If we don't want that, we can use a method
```python 
.reset_index()
```

In [36]:
titanic.groupby('Survived').count()[['Name']].reset_index()

   Survived  Name
0         0   549
1         1   342

### We can group by multiple columns

Notice the row indexes are constructed from both grouping columns

In [37]:
titanic.groupby(['Pclass','Survived']).count()[['Name']]

                 Name
Pclass Survived
1      0           80
       1          136
2      0           97
       1           87
3      0          372
       1          119

In [38]:
#order matters just in presentation
titanic.groupby(['Survived','Pclass']).count()[['Name']]

                 Name
Survived Pclass
0        1         80
         2         97
         3        372
1        1        136
         2         87
         3        119

## So far

```python

df.groupby(by='group_name').agg_func()

.reset_index()

```

## Common Aggregate Functions

.count() – Number of non-null observations

.sum() – Sum of values

.mean() – Mean of values

.median() – Arithmetic median of values

.min() – Minimum

.max() – Maximum

.mode() – Mode

.std() – Standard deviation

.var() – Variance

We would use tables like this for cross-classification - looking at patterns between variables

Let's use a **pivot_table**!

## General Pivot_table
A *pivot_table* allows for cross-classification of groups in a DataFrame.

The general format for a *pivot_table* is –

```python
df.pivot_table(values = 'data', index='group_1', columns='group_2', aggfunc='function')
```

– where:

* each unique value in `index` gets its own row

* each unique value in `columns` gets its own column

* and `data` specifies the value in the DataFrame to which we want to apply `aggfunc`

The default option for `aggfunc` is `mean`.

In [43]:
titanic.pivot_table(values ='Fare', index='Pclass', columns='Survived', aggfunc = 'mean')

Survived          0          1
Pclass
1         64.684007  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

We just looked at this line of code:

In [44]:
titanic.pivot_table(values = 'Fare', index='Pclass', columns='Survived', aggfunc = 'mean')

Survived          0          1
Pclass
1         64.684007  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

In [47]:
#Or I can specify values = 'Fare'
titanic.pivot_table('Fare', index='Pclass', columns='Survived')

Survived          0          1
Pclass
1         64.684007  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

In [48]:
#When I specify agrument =....order doens't matter
titanic.pivot_table(index='Pclass', columns='Survived', values = 'Fare')

Survived          0          1
Pclass
1         64.684007  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

We can remake our earlier table by changing aggfunc

In [51]:
# this is the groupby we saw eariler
titanic.groupby(['Survived','Pclass']).count()[['Name']]

                 Name
Survived Pclass
0        1         80
         2         97
         3        372
1        1        136
         2         87
         3        119

In [49]:
titanic.pivot_table(index='Pclass', columns='Survived', values = 'Fare', aggfunc = 'count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

### <code style="background:Thistle;color:black"> Talk to your neighbor. What is different about the code from the line above and the two lines below (and output)?</code>

In [52]:
titanic.pivot_table(index='Pclass',columns='Survived',values='Name', aggfunc='count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [31]:
titanic.pivot_table(index='Survived',columns='Pclass',values='Name', aggfunc='count')

Pclass      1   2    3
Survived
0          80  97  372
1         136  87  119

### <code style="background:Thistle;color:black"> For each class, what is the maximum ticket fare paid by a survivor? Is it more than the maximum ticket fare paid by someone who did not survive?</code>

In [ ]:
titanic.pivot_table(index=???,columns=???,
               values=???,aggfunc=???)

### What have we seen so far?

```python

df.groupby(by='group_name')

df.pivot_table(data, index='group_1', columns='group_2', aggfunc='function')

.reset_index()
```

## Merging Data

In [6]:
import pandas as pd

titanic = pd.read_csv('../data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Often, the information we need to analyze comes from different sources and is in different files, dataframes, tables, etc.

In database processing, the "join" operator is used to combine data from multiple sources. (Pandas has a "merge" function to do this)

Let's try this on our titanic data - add some information on embarkation

In [7]:
port = pd.DataFrame(
    {'Embarked': ['C','Q','S'], 
    'Port_City': ['Cherbourg','Queenstown','Southampton'],
    'Port_Country': ['France','Ireland','U.K.'],
    'Order': [2,3,1]
    })
port

  Embarked    Port_City Port_Country  Order
0        C    Cherbourg       France      2
1        Q   Queenstown      Ireland      3
2        S  Southampton         U.K.      1

In [8]:
titanic_full = pd.merge(titanic, port)
titanic_full.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Port_City,Port_Country,Order
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S,Southampton,U.K.,1
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S,Southampton,U.K.,1
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S,Southampton,U.K.,1
3,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S,Southampton,U.K.,1

## Let's look more closely at what "joins" do

Which rows of each dataframe should we put together?

What should be in the result?

<center>
<img src="https://raw.githubusercontent.com/SusannaLange/Data_118_images/main/images/individual_dfs.png" alt="merge_data" width="80%">
    
</center>

<center>
<img src="https://raw.githubusercontent.com/SusannaLange/Data_118_images/main/images/merged_df.png" alt="merge_data" width="80%">
    
</center>

## Merge Format
The *merge* method is the most versatile pandas feature for combining DataFrames. The general syntax to merge two DataFrames is:

```python
pd.merge(df_left, df_right)
```

Takes all common column names and all common rows to make a new DataFrame called **inner join**

Different options to merge include: **left, right, inner, and outer.**

We specify how = left or how = right to include all information contained only in one DataFrame. 

Any information not present will be labeled as NaN – “not a number.”

Default

 - Takes order of Left DataFrame

In [11]:
titanic_right = pd.merge(titanic, port, how = 'right') #can change
                                            #how = 'outer' or how = 'left' ...
titanic_right.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Port_City,Port_Country,Order
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cherbourg,France,2
1,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,Cherbourg,France,2
2,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,Cherbourg,France,2
3,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,Cherbourg,France,2
4,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,Cherbourg,France,2

## What happens if everything is not 'nice'

In [14]:
titanic_small = pd.DataFrame(
    { 'passID':[1,2,3],  #ID
      'Survived':[0,1,1], #if they survived or not
     'Name':["Mr. Owen Harris","Mrs. John Bradley","Miss. Laina Heikkinen"]}) #name
titanic_small

   passID  Survived                   Name
0       1         0        Mr. Owen Harris
1       2         1      Mrs. John Bradley
2       3         1  Miss. Laina Heikkinen

In [69]:
people_info = pd.DataFrame(
    { 'Name':["Mr. Owen Harris","Mrs. John Bradley","S Lange"], #name
      'Fav_food':['Eggs','Rice','Spaghetti'] 
     })
people_info

                Name   Fav_food
0    Mr. Owen Harris       Eggs
1  Mrs. John Bradley       Rice
2            S Lange  Spaghetti

In [70]:
pd.merge(titanic_small, people_info)

   passID  Survived               Name Fav_food
0       1         0    Mr. Owen Harris     Eggs
1       2         1  Mrs. John Bradley     Rice

In [71]:
pd.merge(titanic_small, people_info, how = 'right')

   passID  Survived               Name   Fav_food
0     1.0       0.0    Mr. Owen Harris       Eggs
1     2.0       1.0  Mrs. John Bradley       Rice
2     NaN       NaN            S Lange  Spaghetti

In [72]:
pd.merge(titanic_small, people_info, how = 'left')

   passID  Survived                   Name Fav_food
0       1         0        Mr. Owen Harris     Eggs
1       2         1      Mrs. John Bradley     Rice
2       3         1  Miss. Laina Heikkinen      NaN

In [73]:
pd.merge(titanic_small, people_info, how = 'outer')

   passID  Survived                   Name   Fav_food
0     1.0       0.0        Mr. Owen Harris       Eggs
1     2.0       1.0      Mrs. John Bradley       Rice
2     3.0       1.0  Miss. Laina Heikkinen        NaN
3     NaN       NaN                S Lange  Spaghetti

## What if....there was a typo or difference

In [12]:
people_info_with_typo = pd.DataFrame(
    { 'nam':["Mr. Owen Harris","Mrs. John Bradley","S Lange"], #name
      'Fav_food':['Eggs','Rice','Spaghetti']#if they survived or not
     })
people_info_with_typo

                 nam   Fav_food
0    Mr. Owen Harris       Eggs
1  Mrs. John Bradley       Rice
2            S Lange  Spaghetti

In [15]:
pd.merge(titanic_small, people_info_with_typo, left_on = 'Name', right_on = "nam",how = 'left')

   passID  Survived                   Name                nam Fav_food
0       1         0        Mr. Owen Harris    Mr. Owen Harris     Eggs
1       2         1      Mrs. John Bradley  Mrs. John Bradley     Rice
2       3         1  Miss. Laina Heikkinen                NaN      NaN

## What will happen if....nothing in common?

In [76]:
titanic_small

   passID  Survived                   Name
0       1         0        Mr. Owen Harris
1       2         1      Mrs. John Bradley
2       3         1  Miss. Laina Heikkinen

In [77]:
port

  Embarked    Port_City Port_Country  Order
0        C    Cherbourg       France      2
1        Q   Queenstown      Ireland      3
2        S  Southampton         U.K.      1

In [30]:
pd.merge(titanic_small, port)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

## Our repertoire is growing quickly! 

* Arithmetic Operations
* Comparisons
* Assignment Statements
* Call Expressions
* Arrays
* Lists
* DataFrames
* Groupby
* Pivot_table
* Merge